<!DOCTYPE html>
 
<html lang="de">
<head>
<title>Impressum</title> 
<meta charset="UTF-8">

<meta name="description" content="Javascript simulation">
<meta name="keywords" content="Impressum">

<link href="corona.css" rel="stylesheet" type="text/css" />
<link rel="icon" type="image/webp"  href="figs/corona.webp">
</head>

<body lang="de">

<h2>Impressum</h2>

Die Seite <a href="https://www.corona-simulation.de">
https://www.corona-simulation.de</a> wird betrieben von
<a href="mailto:martin@mtreiber.de"> <i>Martin Treiber</i></a> 
<a href="https://www.mtreiber.de/index.html" target="_top">(Homepage)</a>
<br/>

<!--
The page <a href="https://www.corona-simulation.de">
https://www.corona-simulation.de</a> is operated by
<a href="mailto:martin@mtreiber.de"> <i>Martin Treiber</i></a> 
<a href="https://www.mtreiber.de/index.html" target="_top">(Homepage)</a>
<br/>
-->

<h3> Copyright </h3>

Dies ist ein Open-Source Projekt unter der 
<a href="https://github.com/movsim/corona-simulation-de/blob/master/LICENSE">
   gnu general public license v3</a>. Im Wesentliche k&ouml;nnen Sie
   die Inhalte nutzen und selbst publizieren. Wenn Sie die Simulation
   n&uuml;tzlich finden, erbitte ich einen Link auf das
   Originalprojekt, indem Sie den Autor (Martin Treiber) und die Originalseite
   <a href="https://www.corona-simulation.de">corona-simulation.de</a>
   zitieren. 
<br/>

 Der Simulationscode ist auf
<a href="https://github.com/MTGermany/CoronaSim">GitHub</a> verf&uuml;gbar
<br/>

Konstruktive Kommentare, Verbesserungsvorschl&auml;ge und Hinweise auf
Bugs sind willkommen!

 <br></p> <p>

<h3> Haftungsausschluss:</h3>

Die Inhalte unserer Seiten wurden mit gr&ouml;&szlig;ter Sorgfalt erstellt. F&uuml;r
    die Richtigkeit, Vollst&auml;ndigkeit und Aktualit&auml;t der Inhalte k&ouml;nnen
    wir jedoch keine Gew&auml;hr &uuml;bernehmen. <i> Insbesondere
    ist diese Simulation nicht zur direkten Grundlage f&uuml;r
    politische Entscheidungen gedacht</i>. Sie soll jedoch sehr wohl
    darauf hinweisen, wie unvollst&auml;ndig die aktuellen
    Informationen sind und dass vor allem mehr Tests,
    einschlie&szlig;lich randomisierte Tests, n&ouml;tig sind.

 Als Diensteanbieter sind wir
    gem&auml;&szlig; &sect; 7 Abs.1 TMG f&uuml;r eigene Inhalte auf diesen Seiten nach den
    allgemeinen Gesetzen verantwortlich. Nach &sect;&sect; 8 bis 10 TMG sind wir
    als Diensteanbieter jedoch nicht verpflichtet, &uuml;bermittelte oder
    gespeicherte fremde Informationen zu &uuml;berwachen oder nach
    Umst&auml;nden zu forschen, die auf eine rechtswidrige T&auml;tigkeit
    hinweisen. Verpflichtungen zur Entfernung oder Sperrung der
    Nutzung von Informationen nach den allgemeinen Gesetzen bleiben
    hiervon unber&uuml;hrt. Eine diesbez&uuml;gliche Haftung ist jedoch erst ab
    dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung
    m&ouml;glich. Bei Bekanntwerden von entsprechenden Rechtsverletzungen
    werden wir diese Inhalte umgehend
    entfernen.<br><br>

<strong>Haftung f&uuml;r Links</strong><br><br>
 
Unser Angebot enth&auml;lt m&ouml;glicherweise Links zu externen Webseiten Dritter, auf deren
    Inhalte wir keinen Einfluss haben. Deshalb k&ouml;nnen wir f&uuml;r diese
    fremden Inhalte auch keine Gew&auml;hr &uuml;bernehmen. F&uuml;r die Inhalte der
    verlinkten Seiten ist stets der jeweilige Anbieter oder Betreiber
    der Seiten verantwortlich. Die verlinkten Seiten wurden zum
    Zeitpunkt der Verlinkung auf m&ouml;gliche Rechtsverst&ouml;&szlig;e
    &uuml;berpr&uuml;ft. Rechtswidrige Inhalte waren zum Zeitpunkt der
    Verlinkung nicht erkennbar. Eine permanente inhaltliche Kontrolle
    der verlinkten Seiten ist jedoch ohne konkrete Anhaltspunkte einer
    Rechtsverletzung nicht zumutbar. Bei Bekanntwerden von
    Rechtsverletzungen werden wir derartige Links umgehend
    entfernen.<br><br>





  </body>
</html>


