<!DOCTYPE html>
 
<html lang="de">
<head>
<title>Information zur Simulation der Coronavirus Covid-19 Pandemie</title> 
<meta charset="UTF-8">

<meta name="description" content="Javascript simulation">
<meta name="keywords" content="Information, Simulation, Covid19, Impressum">

<link href="corona.css" rel="stylesheet" type="text/css" />
<link rel="icon" type="image/webp"  href="figs/corona.webp">
</head>

<body lang="de" style="margin: 4vw;">

<h1> Information zur Simulation der Coronavirus Covid-19 Pandemie</h1>

<h3> Motivation</h3>
 
Diese <a href="index.html">interaktive Simulation und Datenvisualisierung</a> soll folgendes verdeutlichen:
<ul>
<li> Wie verz&ouml;gert sich Ma&szlig;nahmen zur Isolation oder auch
  anders verursachte &Auml;nderungen der Infektionsrate auf die
  Infektionszahlen auswirken,
<li> wie sehr sich die reale Situation von der beobachteten
  unterscheidet, vor allem, wenn wenig und verz&ouml;gert getestet
  wird,
<li> wie schwierig die <span class="important">
  Reproduktionszahl <i>R</i></span>  und ihr
  zeitlicher Verlauf zu sch&auml;tzen ist: Je nach den Werten der
  anderen Parameter wie Peride der
  Ansteckbarkeit, mittlerer Testzeitpunkt sowie Testh\"aufigkeit 채ndern
  sich die "Best-Fit"-Werte und der Zeitverlauf von <i>R</i>,
<li> dass gesch&auml;tzte Werte wie <i>R=0.92</i>
  ohne <span class="important">Fehlerintervalle</span>  
  nahezu nichts 
  aussagen und dass die Fehler sehr gro&szlig; werden, wenn man sich der
  Gegenwart n&auml;hert. All das k&ouml;nnen Sie hier interaktiv untersuchen!
</ul>

<p class="italic"> <span class="lila">Update Sptember 2020: </span> Obiger Text wurde im April 2020
  formuliert. Nun dringt es langsam ins Bewusstsein, wie stark die
  Testrate die Beurteilung der Lage verzerren kann. Allein durch
  Erh\"ohung der Testh\"aufigkeit wird  der beim RKI
  berechnete R-Wert erh\"oht, was offensichtlich widersinnig ist. </span></p>

<h3> Definitionen</h3>
 
Wichtig ist es, Folgendes zu unterscheiden:


<ul>
<li> <span class="important">
  Reproduktionszahl <i>R</i></span>: Wie viele Menschen ein
  Infizierter im Mittel ansteckt. Manchmal wird noch zwischen  
<i>R<sub>0</sub></i> (Ansteckungszahl bei Durchseuchung Null) und dem
tats\"achlichen, z.B. vom RKI herausgegebenen R-Wert
unterschieden. </i> In der Simulation sind immer
die <i>R<sub>0</sub></i>-Werte angegeben</i>

<li> <span class="important"> Durchseuchung  <i>X</i></span>: Der
  Anteil aller bisher Infizierten (nicht symptomatisch Erkrankten!) in
  der Bev\"olkerung, unabh\"angig vom Ausgang (aktuell infiziert,
  genesen oder tot)

<li> <span class="important"> Immunit\"atsgrad  <i>I</i></span>:
  Wenn alle Infizierten immun werden und keine Impfung verf\"ugbar
  ist, ist <i>I=X</i>, bei Teilimmunit\"at sinkt <i>I</i>, mit
  Impfungen steigt er

<li> <span class="important"> Infektionsrate <i>x</i></span>: Zahl
  der Neuinfizierten in einem gewissen Zeitraum &Delta;t. Falls
  Doppelinfektionen ausgeschlossen werden, g\"alte bei einer
  Bev\"olkerungszahl <i>n</i>
<br><center>
<i>x(t)=n [ X(t)-X(t-&Delta;t) ]</i>
</center><br>

<li> <span class="important"> Testrate <i>n<sub>t</sub></i></span>: Zahl der
    Tests (egal ob positiv oder nicht) pro Tag oder Woche 

<li> <span class="important"> Positivanteil  <i>X<sub>t</sub></i></span>: Der
  Anteil aller bisher positiv Getesteten 
  in der Bev\"olkerung. Dieser ist <i> nicht</i> gleich <i>X</i>, denn
<ul>
<li> nicht jeder Infizierte wird getestet (Dunkelfeld). Ferner sind die Tests
  nicht zu 100% <span class="important"> sensitiv </span> (Fehler erster Art, <i>false negatives</i>),
<li> nicht jeder positiv Getestete ist infiziert, denn die Tests haben eine
  nichtperfekte <span class="important"> Spezifizit\"at </span>
  (Fehler zweiter Art, <i>false 
  positives</i>)
</ul>


<li> <span class="important"> Positivrate <i>x<sub>t</sub></i></span>:
  Zahl der positiven Testergebnisse im Zeitraum &Delta;t. Falls jeder
  h\"ochstens einmal getestet w\"urde, g\"alte 
<br><br><center>
<i>x<sub>t</sub>(t)=n [X<sub>t</sub>(t)-X<sub>t</sub>(t-&Delta;t)]</i>
</center><br>

<li> <span class="important"> <i>Y</i>, <i>Y<sub>t</sub></i> und <i>y<sub>t</sub></i></span>:
Anteilswert an Genesenen in der Bev\"olkerung sowie der Anteilswert
  und die Rate an Genesenen, welche vorher positiv getestet
  wurden. Dies ist tricky: Sind symptomfrei positiv Getestete
  zum Testzeitpunkt bereits genesen oder nicht? Die entsprechenden Daten sind deshalb
  h\"aufig nicht konsistent/brauchbar.

<li><span class="important"> Case  fatality rate (CFR) </span>:
Anteil der positiv Getesteten, die schlie\3lich <i> urs\"achlich</i>  an
    Covid-19 sterben
</ul>


 Ausma&szlig;
 der "Durchseuchung" (was f&uuml;r ein Wort!) abzusch&auml;tzen. In
 der aktuellen Phase kann n&auml;mlich nur das Verh&auml;ltnis
 aus der Zahl der
 Covid-19 Toten und der positiv Getesteten gesch&auml;tzt werden, die
 sogenannte <span class="important"> case
    fatality rate (CFR) </span>. In Deutschland liegt sie (Stand Mai 2020)
 bei etwa 4-5%, was bei einem Hellfeldanteil von
 10% einer Sterbewahrscheinlichkeit von 0.4% entspr&auml;che. Die
 Kenntnis der <span class="important"> wahren Werte der
 Sterbewahrscheinlichkeit</span>  und der
 <span class="important">Durchseuchung</span> ist
 eminent wichtig als Grundlage politischer Entscheidungen.
<br>
Der Hellfeldanteil ist leider unbekannt:
<ul> 
<li> 
<p class="italic"> <span class="lila">Update 2020-09: </span> 
Nun liegt der Positiv-Anteil, die sog. <span class="important"> case
    fatality rate (CFR) </span> um 1%, und man k\"onnte bei einem
  Hellfeld von weiterhin 10% auf eine <span class="important"> infection
    fatality rate (IFR) </span> von 1 &permil; schlie\3en.</p>

<i>Wichtig:</i> Allen Covid-19-Modellen und Simulationen ist
gemeinsam, dass sie <span class="important">keine Prognosen</span>
erm&ouml;glichen. Sehr wohl m&ouml;glich ist aber
eine <i>Szenarienanalyse</i>, also eine bedingte Projektion in die
Zukunft, etwa folgender Art:
<br><br>

<center>
<table width="80%">
<td>
<i>wenn durch die Implementierung oder
Unterlassung von Ma&szlig;nahmen oder durch das Wetter die
Reproduktionsrate  <i>R</i>
den Wert X<sub>1</sub> erreicht, der Infektionszeitraum zwischen X<sub>2</sub> und X<sub>3</sub> liegt,
und wie bisher getestet und medizinisch behandelt wird, dann wird es
zum Zeitpunkt Y eine Zahl Z<sub>1</sub> +/- &Delta;Z<sub>1</sub> an bekannten Infektionen
und eine Zahl Z<sub>2</sub> +/- &Delta;Z<sub>2</sub> an Covid-19-Toten geben</i></td>
</table>
</center>
 
<h3> Simulationsablauf und Bedienung</h3>

Gezeigt wird anf&auml;nglich die Situation in Deutschland, es sind aber
auch andere L&auml;nder einstellbar. Bei Aufruf der Seite wird
zun&auml;chst vom Auftreten der ersten F&auml;lle bis zur Gegenwart
simuliert und die Simulation ab 19.03 (erste ernsthafte
Lockdown-Ma&szlig;nahmen) dargestellt. 
<ul>
<li> Die Parameter sind dabei je nach Land so eingestellt, dass sie mit
den <a href="https://pomber.github.io/covid19/timeseries.json">t&auml;glich
    aktualisierten Beobachtungsdaten</a> weitgehend
  &uuml;bereinstimmen, vor allem die rote Linie (Simulation) mit den
  roten Punkten (Zahl der positiven Corona-Tests).
  Siehe auch das  <a href="https://github.com/pomber/covid19">Github
    Repository</a> dazu.
<!--
<a href="https://data.europa.eu/euodp/en/data/dataset/covid-19-coronavirus-data">beobachteten
  Infektionsdaten des EU Open Data Portal</a> (rote und schwarze
Punkte in der Grafik f&uuml;r dokumentierte F&auml;lle
bzw. Gestorbene) m&ouml;glichst gut &uuml;bereinstimmen. 
-->

<li> Der erste Regler f체r die Reproduktionszahl <i>R</i> ohne jede
  Herdenimmunit&auml;t ist der
  wichtigste. Beim Start oder wenn man sp&auml;ter mit anderen
  Einstellungen neu simuliert oder ein anderes Land
  w&auml;hlt, wird automatisch die Reproduktionszahl in
  Zwei-Wochen-Intervallen neu gesch&auml;tzt. Die jeweils gesch&auml;tzte 
  Reproduktionsrate samt Fehlerintervall wird als grauer Text in die
  Simulation eingezeichnet und der <i>R</i>Regler verschiebt sich wie
  von Geisterhand von selbst. 

 <span class="important"> Insbesondere
  erkl&auml;rt in Deutschland ein seit dem 27.03. ein nahezu
  konstanter <i>R</i>-Wert um 0.70  die
  beobachteten Fallzahlen nahezu perfekt.</span>

Sobald man diesen oder einen anderen
  Regler selbst bedient, wird die Sch&auml;tzung samt Angabe der
  Fehlerintervalle 
  beendet und die angezeigten <i>R</i>-Werte entsprechen der eigenen
  Aktion.

</ul>

F&uuml;r das
Stoppen und Wiederholen der Simulation gibt es drei Eskalationsstufen:
<ul>
<li> Mit 
<img src="figs/buttonGo_small.png"
     style="width:3.5vmin;vertical-align:middle">
 kann man die Simulation f&uuml;r eine Szenarienanalyse vom
  aktuellen Zeitpunkt aus fortf&uuml;hren und mit 
<img src="figs/buttonStop3_small.png"
     style="width:3.5vmin;vertical-align:middle">
wieder stoppen. 
<li> Mit 
<img src="figs/buttonRestart_small.png"
     style="width:3vmin;vertical-align:middle">
startet man die Simulation vom Anfang an mit den gerade eingestellten
     Parametern. Hat man nach dem letzten Reset oder der letzten L&auml;nderwahl
     den <i>R</i>-Regler nicht ge&auml;ndert, wird die
     Parametersch&auml;tzung wieder aktiviert und angezeigt.

<li> Mit <img src="figs/buttonReset2_small.png"
     style="width:3vmin;vertical-align:middle">
<!-- <span class="button">Reload</span>Reload</tt>-Funktion des Browsers <tt>-->
f&uuml;hrt man den "Reset auf die Werkseinstellungen"
    durch. Nur das eingestellte Land bleibt unver&auml;ndert.
</ul>

Die weiteren Bedienelemente der Simulation sind die folgenden:
<ul>
<li> Die <span class="button"> Schieberegler</span> f&uuml;r die
  wichtigsten Modellparameter lassen sich bei gestoppter und auch bei
  laufender Simulation bedienen,
<li> der Button <span class="button"> Kalibriere neu!</span> wirft die
  Sch&auml;tzung der Reproduktionsrate mit den gerade eingestellten
  sonstigen Modellparametern neu an und startet die Simulation neu,</span>
<li> der Button 
<span class="button"> =>log. Darstellung</span> schaltet die Darstellung
jederzeit zwischen linear und logarithmisch um,
<li> mit der
Optionsliste <span class="button">
  Deutschland \/</span> kann man andere L&auml;nder einstellen.
</ul>
 

<h3> Beispiele </h3>
<ol>
<li> <b>Szenario "Unver&auml;ndert": </b>Dr&uuml;cken Sie nach dem Stopp der
      Simulation auf 
<img src="figs/buttonGo_small.png"
     style="width:3.5vmin;vertical-align:middle"> 
und stoppen Sie die Simulation erneut im Juli: Die Infektionen
l&auml;uft sich bei etwa 190 000 gemeldeten Infizierten und insgesamt
     weniger als 
     10 000 Covid-19 Opfern tot, aber selbst
Anfang Juli gibt es noch etwa 10 000 <i>real</i> kranke Personen: Die
Infektion ist noch lange nicht "ausgetrocknet"
<br><br>
<li> <b>Szenario "Laisser faire":</b> Alle Einschr&auml;nkungen werden
  aufgehoben, alles ist wie in Vor-Coronazeiten. Dies k&ouml;nnte
  z.B. einer Reproduktionsrate von 1.5 entsprechen (wie das
  Grippevirus scheint auch das Coronavirus im Sommer weniger
  infizierend zu wirken, deshalb nicht  z.B. <i>R=3</i>): Dr&uuml;cken Sie
Reset <img src="figs/buttonReset2_small.png"
     style="width:3vmin;vertical-align:middle">, 
lassen die Simulation
     bis zur Gegenwart laufen, verschieben den R-Regler auf 1.5 und
     lassen mit <img src="figs/buttonGo_small.png"
     style="width:3.5vmin;vertical-align:middle">  die Simulation etwa
     4 Wochen weiter laufen: Zun&auml;chst geschieht 2 Wochen lang nahezu
     nichts (genau deshalb sind auch die Sch&auml;tzfehler des letzten
     R-Wertes so hoch!), ehe die Fallzahlen wieder verst&auml;rkt
     hochgehen. Lassen Sie die Simulation nun bis Oktober weiterlaufen
     und bet&auml;tigen Sie auch die <span class="button">
  =>log. Darstellung</span>. Nun hat sich bei etwa 45 Millionen
     infizierten Personen, von denen fast alle wieder gesund sind,
     eine Herdenimmunit&auml;t aufgebaut. Eine weitere Erh&ouml;hung
     von <i>R</i> (z.B. weil es Winter wird) bewirkt nahezu keinen
     Effekt mehr. <span class="important"><i>Wichtig:</i></span> Das <i>R</i> in meinem Simulator
     gibt die Reproduktionszahl <i>ohne jede Herdenimmunit&auml;t</i> an,
     die Infiziertenkurve kann deshalb auch bei <i>R>1</i> abflachen.
<br><br>

<li> <b>Szenario "&Auml;nderung des Infektionszeitraums oder der Testverz&ouml;gerung":</b> Der mit den
  zweiten und dritten Regler einstellbare Infektionszeitraum ist neben
  dem R-Wert der wichtigste Parameter der Infektionsdynamik. Wie
  beeinflusst er die R-Sch&auml;tzung? Stellen Sie zun&auml;chst mit Reset
<img src="figs/buttonReset2_small.png"
     style="width:3vmin;vertical-align:middle">, 
den Ausgangszustand her und merken sich die gesch&auml;tzten R-Werte und
     ihre Fehlergrenzen. &Auml;ndern Sie nun den Zeitraum,
     z.B. Ansteckungsstart 6 Tage statt 1 Tag nach der eigenen
     Infektion und dr&uuml;cken Sie 
  <span class="button"> Kalibriere neu!</span>: Je kleiner der
  mittlere Ansteckungstag ist, desto n&auml;her sind die R-Sch&auml;tzungen
  um 1, werden also bei schneller Ansteckung und/oder schnellen Tests und R<1 gr&ouml;&szlig;er, bei
  R>1 (z.B. in Ru&szlig;land oder Indien) kleiner. <span class="important">
  Die Tatsache, dass R>1 oder R<1   gesch&auml;tzt wird,
  ist hingegen <i>robust</i></span>, also unempfindlich gegen&uuml;ber
  &Auml;nderungen der angenommenen Simulationsdynamik. Eine &Auml;nderung
  der Testverz&ouml;gerung (Test
  nach ... Tagen) verschiebt im Wesentlichen nur die Zeitpunkte der R-sch&auml;tzungen.
<br><br>

<li> <b>Szenario "&Auml;nderung der Testrate":</b> Stellen Sie zun&auml;chst mit Reset
<img src="figs/buttonReset2_small.png"
     style="width:3vmin;vertical-align:middle">, 
den Ausgangszustand her. Wenn die Simulation in der Gegenwart
     angelangt ist, verschieben Sie die Testrate von 10% auf 1% und
     dr&uuml;cken Sie dann <img src="figs/buttonRestart_small.png"
     style="width:3vmin;vertical-align:middle">. Obwohl die
     Simulationsdynamik <i>nicht</i> ge&auml;ndert wurde, nur die Art,
     wie gemessen wird, ist nun die simulierte rote Kurve viel zu
     niedrig. Warum, wird klar, wenn Sie auf 
<span class="button"> =>log. Darstellung</span>  umschalten. Da die
    Simulation anfangs mit der richtigen Zahl an <i>positiv
    Getesteten</i> startet, ist die anfangs simulierte <i>reale
    Zahl</i> an Infizierten 10 mal so hoch wie zuvor und in der Gegenwart bereits der Beginn
    einer Herdenimmunit&auml;t erreicht.  Nach  <span class="button">
    Kalibriere neu!</span> stimmt die Kurve wieder, aber nun sind die
    gesch&auml;tzten R-Werte h&ouml;her und zwar derart, dass
    die <i>effektive Reproduktionsrate R(1-I)</i> mit I dem Anteil der
    Immunen (siehe <a href="#model">die Modellbeschreibung</a>) gleich
    ist.
<br><br>

<li> <b>Szenario "zeitliche Erh&ouml;hung der Testrate":</b>
Dieses wichtige Szenario zeigt, wie man allein durch eine zeitlich
  ver&auml;nderliche Testrate zu
  v&ouml;llige falsche Schlussfolgerungen kommen kann! Verschieben Sie
  nach Reset  <img src="figs/buttonReset2_small.png"
     style="width:3vmin;vertical-align:middle"> noch w&auml;hrend der
  Simulation den <span class="button">Testrate-Regler</span>
  allm&auml;hlich von 10% auf 20%: Die simulierten gemessenen Fallzahlen
  sind nun h&ouml;her als die tats&auml;chlich gemessenen, obwohl sich an
  der Infektionsdynamik <i>nichts</i> ge&auml;ndert hat! Reduzieren Sie
  nun R um etwa 0.1 (z.B. von 0.70 auf 0.60), stellen die Testrate
  wieder auf 10%, dr&uuml;cken <img src="figs/buttonRestart_small.png"
     style="width:3vmin;vertical-align:middle"> und verschieben die
  Testrate w&auml;hrend der Simulation wieder auf 20%. Nun sollten die
  rote  Kurve wieder nahezu mit den roten atenpunkten
  &uuml;bereinstimmen: <i>R</i> w&uuml;rde systematisch um 0.1 zu hoch
  gesch&auml;tzt, wenn man eine tats&auml;chliche &Auml;nderung der Testrate
  nicht ber&uuml;cksichtigte! Noch drastischer wird es z.B. bei den USA,
  wenn man w&auml;hrend der Simulation die Testrate von 5% auf 20%
  &auml;ndert: Dann ist die "echte" Reproduktionsrate um 0.9 und nicht
  &uuml;ber 1 wie bei Annahme einer konstanten Testrate.





</ol>

<h3> Simulierte Gr&ouml;&szlig;en</h3>

Alle "dicken" Kurven sind auf das Hellfeld, also auf die getesteten
Personen bezogen, w&auml;hrend die d&uuml;nnen Kurven (nur in der
logarithmischen Darstellung) auf die sich aus der Simulation ergebende
Gesamtheit, also Hell- und Dunkelfeld, beziehen.

<ul>

<li> <span class="red">Rote dicke Kurve:</span> Zahl
  der <em>erfassten</em> positiv getesteten Personen in der
  Simulation. Die zugeh&ouml;rigen <a href="https://pomber.github.io/covid19/timeseries.json">Daten</a> sind als <span class="red">rote Punkte</span> dar&uuml;ber geplottet.

<li> Schwarze dicke Kurve und schwarze Punkte: Analoges f&uuml;r
  die <em>erfasste</em> Anzahl an Covid19-Toten.

<li> <span class="green">Gr&uuml;ne dicke Kurve und Punkte:</span>
    simulierte Zahl der 
    infizierten und wieder gesundeten Personen im Hellfeld.

<li> <span class="blue"> Blaue dicke Kurve und Punkte:</span> Anteil der an Covid19 gestorbenen Personen
    unter allen positiv 
    getesteten, also Quotient der schwarzen und der roten
    Kurve
    (nur in der linearen Darstellung, rechte Skala)

<li> <span class="orange"> Orange d&uuml;nne Kurve:</span> Reale Anzahl der <em>aktuell
      erkrankten</em> Personen, wie sie die Simulation impliziert (nur
      in der logarithmischen Darstellung).
    
<li> <span class="lightgreen"> Gr&uuml;ne d&uuml;nne Kurve:</span>
 Reale Anzahl der <em>aktuell
      wieder gesundeten</em> Personen, wie sie die Simulation
      impliziert (nur
      in der logarithmischen Darstellung). 
</ul>
<em>Hinweis:</em> Da bei den Todesf&auml;llen kein Dunkelfeld angenommen
      wurde, gibt es keine d&uuml;nne schwarze Kurve.
    



</ul>

<a name="model"></a>

<h3> Modell</h3>
Simuliert wird ein Standard-Infektionsausbreitungsmodell:
<ul>

<li> Jeder Infizierte steckt im Laufe seiner Krankheit
<br><br>
<center> 
<i>R(t) (1-I)</i>
</center>
<br>
andere Personen an. Hierbei bedeuten <i>R(t)</i>
den durch verschiedene Ma&szlig;nahmen und/oder durch
das Wetter zeitlich ver&auml;nderlichen <strong>Reproduktionszahl ohne Immunit채t</strong>  und <i>I</i>
den <strong>Immunit&auml;tsanteil</strong>.

<br><br><li> Der Immunit&auml;tsanteil
<center> 
<i>I=x+y+z</i>
</center>
<br>
wird gleich der 
 <strong>Durchseuchungsrate</strong> gesetzt, also gleich der Summe des
Anteils <i>x</i> der gerade (auch symptomfrei) erkrankten Personen, des Anteils <i>y</i> der bereits
wieder gesunden Personen und  des Anteils <i>z</i> der gestorben
Personen. Es wird also davon ausgegangen, dass jeder nur einmal
 erkranken kann und dass keine Impfungen verf&uuml;gbar sind,
 die <i>I</i> weiter erh&ouml;hen w&uuml;rden. Alle Anteilswerte beziehen sich immer auf die Bev&ouml;lkerungszahl am
  Anfang der Pandemie. Die Summe sonstiger Zuw&auml;chse oder Abnahmen
  der Bev&ouml;lkerung wird gleich null gesetzt.


<br><br><li> Die Ansteckung geschieht gleichverteilt innerhalb eines einstellbaren
  <strong>Infektionsalters</strong>. Der Einfachheit halber ist die
  Ansteckungsverteilung unabh&auml;ngig vom Alter und von der Existenz
  oder Schwere der Symptome.

<br><br><li> Die Infizierten sterben im Laufe der Krankheit mit der
  <strong>wahren Sterblichkeit</strong> <i>p<sub>D</sub></i>, und zwar
  gleichverteilt nach
  &tau;<sub>D</sub>&plusmn;2 Tagen

<br><br><li> Mit der Komplement&auml;rwahrscheinlichkeit <i>(1-p<sub>D</sub>)</i> erholen sich die Infizierten, und zwar
  gleichverteilt
  &tau;<sub>Rec</sub>&plusmn;2 Tage nach der Infektion. 

</ul>


<h3>Modell der Datenerhebung</h3>

<span class="important">Dies betrachte ich als <i>Unique Selling
    Point</i> meines Simulators</span>
<ul>
<li> Getestet wird ein durch die <strong>Testrate</strong>
  <i>p<sub>T</sub></i> einstellbarer Anteil an 
  (auch symptomfrei) erkrankten Personen. Die zus&auml;tzlich
  durchgef&uuml;hrten Tests an gesunden Personen, die sich als nicht
  angesteckt erweisen, tauchen hier nicht auf (sie sind aber wichtig
  zur Sch&auml;tzung des Modellparameters der wahre
  Sterblichkeit <i>p<sub>D</sub></i>).
<br><br>
<span class="important">Wichtig:</span> Die Simulation wird so
initialisiert/initial parametrisiert, dass die <em>beobachteten</em>,
nicht aber die <em>tats&auml;chlichen</em> Fallzahlen vorgegeben sind. Je
nach Testrate sind dir tats&auml;chlichen Fallzahlen (d&uuml;nne Linien
in der logarithmischen Darstellung) zu gegebenen
Zeitpunkt stark unterschiedlich! An die Testrate habe ich auch die
wahre Sterblichkeit <i>p<sub>D</sub></i> gekoppelt, da die unbekannte
tats&auml;chliche Sterbewahrscheinlichkeit sich zumindest anf&auml;nglich
(geringe Immunit&auml;t) nur als Verh&auml;ltnis
<i>p<sub>D</sub>/p<sub>T</sub></i> <span class="blue"> (blaue
  Kurve)</span> manifestiert. 

  <br><br><li> Der Test ist ideal, weist also weder <i>false positives</i>
noch <i>false negatives</i> auf.

<br><br><li> Getestet wird &tau;<sub>T</sub>&plusmn;2 Tage nach der Infektion.

<br><br><li> Wird die Testrate w&auml;hrend der Simulation ver&auml;ndert,
  bezieht sich dies nur auf neue Tests. Wird beispielsweise zum
  Zeitpunkt <i>t</i> die Testrate von 10% auf 20% erh&ouml;ht,
  werden die vor dem Zeitpunkt <i>t-&tau;<sub>T</sub>-2</i> Infizierten zu
  10% (positiv) getestet, die nach dem
  Zeitpunkt <i>t-&tau;<sub>T</sub>+2</i> zu 20% und die dazwischen linear
  ansteigend zwischen 10% und 20% 

<br><br><li> Bei den Toten ist die Dunkelziffer gleich null, d.h. jeder an Covid19
  Gestorbene wird entweder w&auml;hrend der Krankheit oder danach durch Autopsie
  getestet. Durch Konsistenzbetrachtung im Flie&szlig;gleichgewicht oder am
  Ende der Epidemie ergibt sich daraus der Anteil
  der <strong>dokumentiert Gesundeten</strong> unter allen Getesteten
  f&uuml;r jeden Infektionstag getrennt zu 
<br><br>
<center>
<i>P(recovered|positively tested)=(p<sub>T</sub> - p<sub>D</sub>)
 / (1-p<sub>D</sub>)</i>
</center>
<br>
Offensichtlich ergibt dies nur Sinn, wenn 
<i>p<sub>T</sub> &gt; p<sub>D</sub></i>
</ul>

<h3>Parameter</h3>
<h4> (1) Vom Nutzer beeinflussbare Werte</h4>

<ul>
<li><span class="important">Reproduktionszahl <i>R</i>. </span> 
<strong>Dies  ist der 
  wichtigste der politisch beeinflussbaren Parameter</strong>. <i>R</i>-Werte  &lt; 1 f&uuml;hren zu
  einer exponentiellen Abnahme an Neuinfektionen, 
  <i>R &gt; 1</i> 
 anfangs zu einer exponentiellen Zunahme an Neuinfektionen,
  Bestandsinfektionen, Toten und Gesundeten
  und  <i>R=1</i> anfangs zu einer konstanten Rate an
  Neuinfektionen und zu einer linearen Zunahme von
  Bestandsinfektionen, Toten und
 Gesundeten. 
<br><br>

<i>R</i> wird reduziert durch
<ul>
<li> Isolation nach dem Schrotschussverfahren (wie im April 2020)
<li> gezielte Isolation Einzelner nach positiver Testung: Je geringer
  dabei die Dunkelziffer, desto besser,
<li> und nicht zuletzt vermutlich durch warmes Wetter, wie jede Grippe.
</ul>
Nat&uuml;rlich wird die Epidemie auch durch sp&auml;ter verf&uuml;gbare
Impfungen, d.h. externe Erh&ouml;hung von <i>I</i>, ausgebremst.

<br><br><li> <span class="important">Ansteckungsstart</span> 
gleich 1 Tag bedeutet, bereits einen
  Tag nach der Infektion ist die (dann fast immer symptomfreie) Person
  ansteckend


<br><br><li><span class="important">Ansteckungsende</span> gleich 10 Tage
  bedeutet, 11 Tage nach  der Infektion  ist
  die Person nicht mehr ansteckend bzw. in Quarant&auml;ne. 
<br>
Auch wenn die
  reale Ansteckungsdauer l&auml;nger ist, reflektiert diese Einstellung,
  dass andere Personen eher am Anfang des Infektionsalters angesteckt
  werden. 


<br><br><li><span class="important">Test nach</span> x Tagen: Mittlere
    Verz&ouml;gerung zwischen Infektionsanfang und
    Test. <strong>Beeinflussbar!</strong> 

<br><br><li><span class="important">Testrate <i>p<sub>T</sub></i></span>:
    Anteil der positiv Getesteten unter den
    Infizierten. <strong>Beeinflussbar! </strong>
</strong> 

<!--
<br><br><li><span class="important">Sim-Geschwindigkeit</span>:
    Beeinflusst nur die Geschwindigkeit der Simulation in Tagen pro Sekunde, nicht aber die
    dargestellte Dynamik.
-->
</ul>




</ul>


<h4> (2) Feste Werte</h4>
Diese sind so eingestellt, dass die Simulation mit den Daten
&uuml;bereinstimmt. Sie k&ouml;nnen
im <a href="https://github.com/MTGermany/CoronaSim">Open-Source
  Quellcode</a> ver&auml;ndert werden und zwar i.A. am Anfang
von <tt>corona.js</tt>

 
<ul>
<li> Anf&auml;ngliche Reproduktionszahlen <tt>R01, R02, R03</tt> und
  zugeh&ouml;rige positiv getestete Fallzahlen <tt>nxt1, nxt2</tt>
  und <tt>nxtR0</tt>. Der Wert von <tt>nxtR0</tt> bestimmt die Zeit, ab der der Schieberegler-Wert von 
<i>R<sub>0</sub></i> gilt 
  (sobald die Zahl der positiv getesteten F채lle <tt>nxtR0</tt>
  &uuml;berschreitet) und definiert auch in der
  Grafik die vertikale graue Linie.


<li> Sterbewahrscheinlichkeit <i>p<sub>D</sub></i> bzw. in Javascript <tt>fracDie</tt>. Dies ist auf 0.004
  initialisiert, wird aber auf <i>p<sub>D</sub>=0.04
  p<sub>T</sub></i> gesetzt, 
  wenn beim Neustart die
  Testwahrscheinlichkeit <i>p<sub>T</sub></i> ungleich ihrem
  anf&auml;ngichen Wert 
  von 10% ist. 

<li> Mittlere Zeitdauer &tau;<sub>D</sub> bzw im
  Javascript <tt>tauDie</tt> von der Infektion bis zum Tod

<li> Mittlere Zeitdauer &tau;<sub>Rec</sub> bzw im
  Javascript <tt>tauRecover</tt> von der Infektion bis zur Genesung

</ul>
<hr>
<a href="impressum.html">Impressum</a>


  </body>
</html>


